Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_RU-EN_repaired_repaired_repaired.tmx
Source language: ru_ru
Languages: en_us

source: Побеждай в любой схватке с новыми обликами!
en_us: Win any battle with the new Skins!

source: А облик Темпуса можно дополнительно улучшить, чтобы вдвое усилить его броню!
en_us: Tempus’s Skin can also be upgraded to double his armor!

source: Получи новые ангельские облики для Альванора и Темпуса!
en_us: Get the new angelic Skins for Alvanor and Tempus!

source: Обрети силу небес!
en_us: Obtain the power of heavens!

source: Ангельские облики для Альванора и Темпуса доступны всего 3 дня!
en_us: Angelic Skins for Alvanor and Tempus are only available for 3 days!

source: С ними ты победишь в любой схватке.
en_us: You’ll surely win any battle with them.

source: А улучшенный облик Темпуса увеличивает броню вдвое!
en_us: And Tempus’s upgraded Skin doubles his armor!

source: Прокачай героев, раскрой их божественный потенциал и сокруши любого, кто встанет на пути!
en_us: Upgrade your Heroes, discover their divine potential, and defeat anyone standing in your way!

source: Встречай изумрудный август!
en_us: Welcome to the Emerald August!

source: Не пропусти новые драгоценные предложения!
en_us: Don’t miss out on these sparkling new offers!

source: Синоптики прогнозируют изумрудный дождь!
en_us: Forecasters are predicting an emerald rain!

source: Поспеши открыть матрешки и получить максимум выгоды с каждого лота!
en_us: Hurry to open Matryoshkas and get the most value from every lot!

source: Изумрудные матрешки со скидкой 65% и акция х4 на все лоты!
en_us: Emerald Matryoshkas at 65% off and a 4x bonus on all lots!

source: Щедрый циклон продержится недолго — успей получить от события максимум выгоды!
en_us: But this generous weather won’t last long—make the most of it while you can!

source: Открывай изумрудные матрешки со скидкой 65% и получай в 4 раз больше изумрудов с каждого лота!
en_us: Open Emerald Matryoshkas at a 65% discount and get 4 times more Emeralds from every lot!

source: Пополни запасы ценной валюты и улучши свою команду, чтобы дать отпор любому противнику!
en_us: Stock up on this precious currency and strengthen your team to stand firm against any opponent!

source: Охотница Ойя уже в игре!
en_us: Oya the Huntress is here!

source: Пугающие боссы для нее всего лишь добыча!
en_us: Formidable bosses are just prey to her!

source: Пройди опасное приключение в глубинах джунглей вместе с принцессой забытого племени и узнай о древнем пророчестве!
en_us: Embark on an Adventure in the depths of the jungle with a princess of a forgotten tribe and learn the ancient prophecy!

source: Охота начинается — Ойя уже в игре!
en_us: The hunt is on! Oya is here!

source: Заставь всех врагов пасть перед ее натиском!
en_us: Make all enemies fall before her onslaught!

source: Новое приключение перенесет тебя в глубины забытых джунглей!
en_us: A new Adventure will transport you into the depths of the jungle!

source: Враги будут ждать на каждом шагу, но с талантами Ойи вмиг превратятся в добычу!
en_us: Enemies will be lying in wait everywhere, but Oya’s talents will instantly turn them into prey!

source: Присоединяйся к принцессе забытого племени, расправься с опасными боссами и помоги ей принять непростое бремя вождя!
en_us: Join the princess of the forgotten tribe, defeat dangerous bosses, and help her accept the burden of being a chieftain!

source: Пройди путь героя!
en_us: Walk the hero's way!

source: Забери все трофеи боевого пропуска!
en_us: Obtain all the Battle Pass trophies!

source: Выполняй задания и собирай ресурсы!
en_us: Complete tasks and collect resources!

source: Премиум даст еще больше трофеев и солнечный облик для Ксе’Ши!
en_us: The Premium version will provide even more trophies and a Solar Skin for Xe’Sha!

source: Пройди путь героя и получи все трофеи нового боевого пропуска!
en_us: Walk the hero's way and obtain all the Battle Pass trophies!

source: Встречай лето с приключениями!
en_us: Welcome the summer adventures!

source: Выполняй задания «Пути героя» и собирай ресурсы.
en_us: Complete the “Hero’s Way” tasks and collect resources.

source: Премиум-пропуск откроет доступ к суперпризам: еще больше трофеев и уникальный солнечный облик для Ксе’Ши, усиливающий ее магический крит!
en_us: The Premium version of the Pass will open up the way to the Grand Prizes for you—even more trophies and a unique Solar Skin for Xe’Sha that strengthens her magic crit!

source: Проверь себя — пройди путь до конца и стань героем лета!
en_us: Challenge yourself—reach the end of the journey and become the hero of the summer!

source: Начни лето с новыми обликами!
en_us: Summer starts with new Skins!

source: Получи новые солнечные облики Солея и Фобоса!
en_us: Get new Solar Skins for Soleil and Phobos!

source: У тебя всего 3 дня, чтобы получить эти уникальные облики и супероблик Фобоса, дающий х2 к магической атаке!
en_us: You’ve got only 3 days to get these unique Skins and a Superskin for Phobos that gives x2 Magic Attack!

source: Получи новые солнечные облики для Солея и Фобоса!
en_us: Get new Solar Skins for Soleil and Phobos!

source: В Доминионе наступили солнечные дни!
en_us: Sunny days have come to Dominion!

source: А где жаркая погода, там и горячие предложения: новые солнечные облики для Солея и Фобоса будут доступны всего 3 дня!
en_us: And where there is hot weather there are hot deals: new Solar Skins for Soleil and Phobos will be available only for 3 days!

source: Не упусти шанс также получить супероблик Фобоса, который дает х2 к магической атаке.
en_us: Don’t miss the chance to also get a Superskin for Phobos that gives x2 Magic Attack.

source: Проведи лето ярко!
en_us: Let your summer be bright!

source: Встречай новую героиню — Сомну
en_us: Meet a new Hero—Somna

source: Одолей могучих боссов и узнай историю волчицы!
en_us: Defeat mighty bosses & learn the she-wolf’s story!

source: В новом приключении тебя ждут бесчисленные волны врагов — усыпи их способностями Сомны и одержи победу!
en_us: Endless waves of enemies await you in the new Adventure. Put them to sleep using Somna’s skills and achieve victory!

source: Новая героиня Сомна уже в игре!
en_us: A new Hero—Somna—is here!

source: Сразись с боссами и раскрой историю волчицы!
en_us: Fight the bosses and uncover the she-wolf’s story!

source: Когда-то Сомна отказалась от битв и научилась безболезненно усыплять врагов, но покой ее был недолгим... В новом приключении тебе предстоит погрузиться в историю бывшей воительницы и восстановить баланс между снами и реальностью!
en_us: Somna has turned her back on fighting and learned to painlessly put her enemies to sleep, but her peace was not to last... In the new Adventure, you will delve into the former warrior’s story and restore the balance between dreams and reality!

source: Преодолевай волны врагов и усыпляй даже самых могучих боссов — от колыбельной Сомны никому не скрыться!
en_us: Overcome waves of enemies and put even the mightiest bosses to sleep. Nobody can escape Somna’s lullaby!

source: Врата царства открыты!
en_us: The Gates of the Realm are open!

source: Игроки уровня 80+ уже могут участвовать в новых активностях, получать щедрые награды, усиливать Стражей и призвать нового героя — Леонеля.
en_us: Players level 80+ can now take part in new activities, earn generous rewards, strengthen the Guardians, and recruit a new Hero — Leonel.

source: Как быстрее всего прокачаться и собрать максимум наград?
en_us: How can you level up quickly and collect maximum rewards?

source: Шаг 1.
en_us: Step 1.

source: Развивай Зал героев.
en_us: Develop the Hall of Heroes.

source: Это сердце твоего царства.
en_us: This is the heart of your Realm.

source: Его уровень открывает новые улучшения зданий, Технологии и главы истории.
en_us: Its level unlocks new building upgrades, Technologies, and story chapters.

source: Шаг 2.
en_us: Step 2.

source: Прокачивай другие здания.
en_us: Upgrade other buildings.

source: Чем больше домов и выше их уровень, тем больше рабочих.
en_us: The more Houses you have and the higher their level, the more Workers you gain.

source: Лучше шахты — больше ресурсов.
en_us: Better Mines mean more resources.

source: Выше уровень Исследовательского центра — сильнее ВСЕ герои и быстрее экономическое и военное развитие царства!
en_us: A higher-level Research Center makes ALL your Heroes stronger and accelerates your Realm's economic and military development!

source: ⚔️ Шаг 3.
en_us: ⚔️ Step 3.

source: Сильные герои + войска, развитые с помощью технологий и улучшенные в специальных военных зданиях = легкие победы над монстрами и успех в рейдах с товарищами по гильдии.
en_us: Strong Heroes + troops enhanced through Technologies and upgraded in special military buildings = easy victories over monsters and success in Guild Rallies.

source: Поздравляем, у тебя куча ресурсов!
en_us: Congratulations — you now have plenty of resources!

source: Повторяй эти шаги, и ты будешь зарабатывать все больше и больше наград, а твои герои и войска станут еще мощнее!
en_us: Repeat the cycle starting from Step 1, and you'll earn more and more rewards while your Heroes and troops grow even stronger!

source: Остались вопросы?
en_us: Still have questions?

source: Загляни в F.
en_us: Check out the F.

source: Полезные статьи обо всех механиках и тонкостях царства: ➡️ Царство и экономика: ссылка ➡️ Мировая карта и бои: ссылка
en_us: Helpful articles about all of Realm’s mechanics and details: ➡️ Realm and Economy: link ➡️ World Map and Battles: link

source: КОНКУРС!
en_us: CONTEST!

source: Пиши в комментариях, что ты уже успел попробовать в царстве и какие награды собрал!
en_us: Write in the comments what you've already tried in the Realm and which rewards you've collected!

source: Добавляй к комментарию свой ID и получи шанс ВЫИГРАТЬ набор УСКОРИТЕЛЕЙ (универсальный ускоритель на 4ч, ускоритель строительства на 4ч, ускоритель тренировки на 4ч, ускоритель исследований на 4ч)!
en_us: Add your ID to the comment for a chance to WIN a set of SPEEDUPS (4h Universal Speedup, 4h Construction Speedup, 4h Training Speedup, 4h Research Speedup)!

source: Мы объявим 15 счастливчиков в комментариях под этим постом 2 марта.
en_us: We will announce 15 winners in the comments under this post on March 2.

source: Полные правила: LINK
en_us: Full rules: LINK

source: ПОДАРОК!
en_us: GIFT!

source: Скорее в игру! Царство ждет тебя!
en_us: Jump into the game — the Realm awaits you!

source: Развивайся, усиливай армию и сокруши силы зла!
en_us: Develop your Realm, strengthen your army, and crush the forces of evil!

source: F.A.Q. о царстве В: Что такое царство? О: Царство — новый игровой режим, позволяющий развивать собственное поселение, собирать армию и с её помощью сражаться с монстрами и добывать награды на карте мира. И конечно же режим открывает доступ к исследованиям в Исследовательском центре, которые позволяют разблокировать могущественные усиления для всех героев, а также вашей армии и поселения. Развитие героев и войск, получение Леонеля В: Как получить бонус к характеристикам героев? О: Развивай базу, чтобы построить Исследовательский центр. Технологии разделены на три вида: развитие, экономика и битва. Каждый из них усиливает разные аспекты твоего прогресса: армия становится сильнее, развитие быстрее, база крепче, но самое главное — ты можешь улучшить всех своих героев. Суммарно технологии дадут следующие бонусы твоим Героям: Здоровье: +105000 Броня: +15 Уворот: +15 Шанс маг. критического удара: +15% В: Для чего нужны фолианты? О: Фолианты необходимы для прокачки новых навыков героев, влияющих на сражения войск. Ты можешь найти описание этих навыков в разделе «Царство» в меню навыков. В: Как получить нового героя? О: Фрагменты Леонеля могут быть получены по мере развития базы, а также (с определённой вероятностью) на карте в рейде и за победы над монстрами 15 уровня и выше. Фрагменты рецепта красного предмета Леонеля, фрагменты его артефактного оружия и камни облика могут быть получены в рейде. Фрагменты артефактного тома Леонеля получаются из лагерей бандитов. Фрагменты артефактов Леонеля также получаются в небольших количествах за квесты развития. Талисман Леонеля получается за квест за достижение 25 уровня Зала героев. В: Какую роль играют герои в новом режиме? О: Герои необходимы для сражений на карте и играют ключевую роль в определении победителя. В: Зачем нужны войска? О: Войска помогают героям в сражениях на мировой карте. Войска сражаются друг с другом параллельно героям. Войска делятся на 3 типа: Пехота, Копейщики, Стрелки. Пехота имеет преимущество над копейщиками, копейщики над стрелками, а стрелки — над пехотой. Войска таже помогают переносить ресурсы из шахт. В: Как войска участвуют в боях? Характеристики войск, боёвка войск О: Войска помогают героям в сражениях на мировой карте. Войска сражаются друг с другом параллельно героям, их количество и успешность в бою с войсками противника влияют на параметры урона и защиты героев. Таким образом, параметры войск, такие как здоровье, защита, атака и смертоносность влияют на результаты боя между войсками игрока и противника. Смертоносность влияет на шанс критического удара и мгновенного убийства при атаке юнита противника. В: Почему нового героя можно получить только в царстве? О: Мы хотели вознаградить игроков чем-то особенным и уникальным за участие в новом режиме. Леонель — новый герой, доступный только в царстве. Все элементы его прокачки могут быть получены просто за игру в новом режиме. Постройка и прокачка зданий В: Зачем улучшать Зал героев? О: Зал героев — главное здание царства. От его уровня зависит множество процессов: открытие и улучшение зданий, открытие Технологий для улучшения героев, прохождение глав истории. Повышая уровень Зала героев, ты получаешь возможность прокачивать все остальное в царстве. В: Зачем улучшать другие здания? О: Чем выше уровень зданий, тем больше пользы они приносят твоему царству. Например, дома более высокого уровня = больше рабочих, прокачанные ферма, лесопилка, каменоломня и железная шахта = больше ресурсов, улучшенные военные здания = более сильные войска, высокий уровень Исследовательского центра = более крутые технологии, которые улучшают всех твоих героев, а также влияют на скорость и эффективность экономической и военной сфер. В: Зачем нужны дома? О: Дома дают рабочих, которые требуются ферме, лесопилке, каменоломне и железной шахте, а также увеличивают время, в течение которого ты сможешь получать ресурсы, пока не находишься непосредственно в режиме царства. Ресурсы и награды В: Зачем нужны ресурсы (хлеб, дерево, железо)? О: Еда, дерево, камень и железо — основные ресурсы царства, необходимые для постройки и улучшения строений, обучения войск и проведения исследований в Исследовательском центре. В: Зачем нужен эларит? О: Эларит позволяет улучшать часть мебели в строениях твоего царства, а также необходим для проведения всех исследований. В: Как получить больше эларита? О: Уровень добычи эларита в портале зависит от того, насколько далеко у тебя пройдена кампания. В: Какие награды можно получить в царстве? О: Рунные камни, зелья титанов, фрагменты артефактов титанов, камни обликов титанов, золото, зелья опыта, фрагменты душ героев, уникальный герой Леонель и всё для его прокачки, Фолианты, а также ресурсы для развития твоего царства. В:Какие герои выпадают из Трофейной шкатулки душ? О: Из Трофейной шкатулки душ всегда выпадают камни души Леонеля, а также 6 других героев в ротации. Ротация обновляется примерно раз в сезон.
en_us: Realm F.A.Q. Q: What is the Realm? A: The Realm is a new game mode that allows you to develop your own settlement, build an army, and use it to fight monsters and earn rewards on the world map. You can also conduct research in the Research Center, which provides powerful upgrades for all Heroes, as well as for your army and settlement. Hero and Troop Development, and Unlocking Leonel Q: How can I increase my Heroes' stats? A: Develop your base to construct the Research Center. Technologies are divided into three categories: Growth, Economy, and Battle. Each category helps you progress in different ways: your army gets stronger, development accelerates, your base becomes more resilient — and most importantly, you can enhance all your Heroes. In total, Technologies grant your Heroes the following bonuses: Health: +105000 Armor: +15 Dodge: +15 Magic Critical Hit Chance: +15% Q: What are Tomes used for? A: Tomes are required to upgrade new Hero skills that affect troop combat. You can find descriptions of these skills in the “Realm" section of the skills menu. Q: How do I get the new Hero? A: Leonel Fragments can be earned as you develop your base. They may also drop from Rallies on the map and from level 15+ monsters. Fragments of Leonel's red item recipe, his Artifact Weapon Fragments, and Skin Stones can be obtained in Rallies. Leonel's Artifact Tome Fragments can be obtained from brigand camps. Small amounts of Leonel's Artifact Fragments are also rewarded for development quests. Leonel's Talisman is obtained from a quest for reaching level 25 of the Hall of Heroes. Q: What role do Heroes play in the new mode? A: Heroes are essential for battles on the map and play a key role in determining victory. Q: Why are troops needed? A: Troops support Heroes in battles on the world map. Troops fight enemy troops alongside Heroes. There are 3 troop types: Infantry, Spearmen, and Marksmen. Infantry have an advantage over Spearmen, Spearmen over Marksmen, and Marksmen over Infantry. Troops also help transport resources from Mines. Q: How do troops participate in battles? Troop stats and combat mechanics A: Troops support Heroes in battles on the world map. They fight in parallel with Heroes, and their numbers and performance in combat influence Hero damage and defense stats. Troop stats such as Health, Defense, Attack, and Lethality affect the outcome of troop combat. Lethality affects the chance to critically strike or instantly kill an enemy unit when attacking. Q: Why can the new Hero only be obtained in the Realm? A: We wanted to reward players with something special for participating in the new mode. Leonel is a new Hero available exclusively in the Realm. Everything required to upgrade him can be obtained simply by playing this mode. Building Construction and Upgrades Q: Why upgrade the Hall of Heroes? A: The Hall of Heroes is the most important building in the Realm. Its level determines many processes: unlocking and upgrading buildings, unlocking Technologies to enhance Heroes, and progressing through story chapters. By increasing its level, you gain the ability to upgrade everything else in the Realm. Q: Why upgrade other buildings? A: The higher a building's level, the more benefits it provides for your Realm. For example: higher-level Houses = more Workers; upgraded Farm, Lumber Mill, Stone Quarry, and Iron Mine = more resources; upgraded military buildings = stronger troops; a higher-level Research Center = more advanced Technologies that enhance all your Heroes and improve economic and military efficiency. Q: Why are Houses needed? A: Houses provide Workers for the Farm, Lumber Mill, Stone Quarry, and Iron Mine. They also increase the duration during which you continue generating resources while not in the Realm mode. Resources and Rewards Q: What are resources (Food, Wood, Iron) used for? A: Food, Wood, Stone, and Iron are the primary resources of the Realm. They are required to construct and upgrade buildings, train troops, and conduct research in the Research Center. Q: What is Elarite used for? A: Elarite is used to upgrade certain furniture in the Realm buildings and is required for all research. Q: How can I get more Elarite? A: The amount of Elarite obtained from the Portal depends on how far you have progressed in the Campaign. Q: What rewards can be obtained in the Realm? A: Rune Stones, Titan Potions, Titan Artifact Fragments, Titan Skin Stones, Gold, EXP Potions, Hero Soul Fragments, the unique Hero Leonel and all materials needed to upgrade him, Tomes, as well as resources for developing your Realm. Which Heroes drop from the Soul Trophy Chest? A: The Soul Trophy Chest always contains Leonel Soul Stones, along with 6 other Heroes in rotation. The rotation updates approximately once per season.

source: Рык Природы
en_us: Roar of Nature

source: Дух Защитник наносит всем противникам %prime% урона и лечит союзных героев на %secondary%.
en_us: The guardian spirit deals %prime% damage to all enemies and heals allies for %secondary%.

source: ^{85 221 85}^100%^{/color}^ лечения от этой способности преобразуется в увеличение максимального здоровья до конца боя.
en_us: ^{85 221 85}^100%^{/color}^ of healing by this skill is converted into max health increase until the end of battle.

source: Урон: %prime%
en_us: Damage: %prime%

source: Лечение: %secondary%
en_us: Healing: %secondary%

source: Дух-защитник
en_us: Guardian Spirit

source: Призывает Духа Защитника, который связывается с передним героем с ролью Танк.
en_us: Summons the guardian spirit that binds to the Hero at the front with a Tank role.

source: Если такого героя нет, крепится к случайному союзнику.
en_us: If there is no such Hero, binds to a random ally.

source: Союзник под защитой Духа получает 50% урона, а Дух получает остальной урон.
en_us: The ally protected by the spirit receives 50% of incoming damage. The rest of it is dealt to the spirit.

source: Дух имеет %prime% здоровья.
en_us: The spirit has %prime% health.

source: Пока Дух жив, атаки Бирны не наносят урона, но заставляют Духа атаковать, нанося %secondary% урона.
en_us: While the spirit is alive, Byrna's attacks don't deal any damage but command the spirit to attack dealing %secondary% damage.

source: Дух не может быть атакован или исцелён напрямую, но когда союзник под его защитой исцеляется, Дух тоже исцеляется на ^{85 221 85}^200%^{/color}^ от значения лечения.
en_us: The spirit can't be attacked or healed directly, but when the ally under his protection is healed, the spirit also heals for ^{85 221 85}^200%^{/color}^ of the original amount.

source: Здоровье Духа: %prime%
en_us: Spirit's health: %prime%

source: Урон Духа: %secondary%
en_us: Spirit's damage: %secondary%

source: Медвежьи Объятия
en_us: Bear Cuddle

source: Накладывает на переднего союзника эффект, который исцеляет его на %prime% в секунду в течение %duration%.
en_us: Applies an effect to an ally at the front that heals them for %prime% a second for %duration%.

source: Во время действия эффекта всё входящее в этого союзника лечение расходится целебной волной вокруг него, восстанавливая %secondary%% от изначального значения.
en_us: While this effect is active, all incoming healing on this ally reverberates around them in a wave that restores health to allies in the amount of %secondary%% of the initial healing.

source: Если Дух Защитник жив, то эффект накладывается на союзника под его защитой.
en_us: If the guardian spirit is alive, the effect is applied to the ally under his protection.

source: Лечение в секунду: %prime%
en_us: Healing per second: %prime%

source: Восстановление здоровья союзникам: %secondary%%
en_us: Health restored to allies: %secondary%%

source: Живое Сердце
en_us: Living Heart

source: Каждый раз когда союзник восстанавливает здоровье, магическая атака Бирны увеличивается на %prime% до конца боя.
en_us: Every time an ally restores health, Byrna's Magic Attack gets increased by %prime% until the end of battle.

source: Увеличение магической атаки: %prime%
en_us: Increased Magic Attack: %prime%

source: Бирна
en_us: Byrna

source: Молодая орчиха Бирна не нашла места в своем племени.
en_us: A young she-orc Byrna couldn't find a place within her tribe.
